//=========================================================
//DirectXでの8方向移動処理[fade.h]
//Author:Yumika Matsushita
//
//=========================================================

//=====================================
//マクロ定義
//=====================================
#ifndef _FADE_H_	//このマクロ定義がされてなかったら
#define _FADE_H_	//2重インクルード防止のマクロ定義

//=====================================
//インクルード
//=====================================
#include "main.h"

//=====================================
//画面モードの種類
//=====================================
typedef enum
{
	FADE_NONE = 0,
	FADE_IN,
	FADE_OUT,
	FADE_MAX
}FADE;

//=====================================
//フェード構造体の定義
//=====================================
//typedef struct
//{
//	float nLife;
//}Fade;

//=====================================
//プロトタイプ宣言
//=====================================
void InitFade(void);
void UninitFade(void);
void UpdateFade(void);
void DrawFade(void);
void SetFade(MODE ModeNext);
int GetFadeColor(void);
FADE GetFade(void);

#endif
