//=========================================================
//3Dgame[pause.h]
//Author:Yumika Matsushita
//
//=========================================================

//=====================================
//マクロ定義
//=====================================
#ifndef _PAUSE_H_	//このマクロ定義がされてなかったら
#define _PAUSE_H_	//2重インクルード防止のマクロ定義

//=====================================
//インクルード
//=====================================
#include "main.h"

//=====================================
//ポーズ画面の構造体
//=====================================
typedef struct
{
	D3DXVECTOR3 pos;	//動き(普通)
	int nType;			//モードの種類
	bool bUse;			//使用の有無
	bool bColUse;		//ポリゴンのカラーの有無
}Pause;

//=====================================
//マクロ定義
//=====================================


//=====================================
//プロトタイプ宣言(処理)
//=====================================
void InitPause(void);
void UninitPause(void);
void UpdatePause(void);
void DrawPause(void);
void SetPause(D3DXVECTOR3 pos);

#endif