//=========================================================
//DirectXでの8方向移動処理[title.h]
//Author:Yumika Matsushita
//
//=========================================================

//=====================================
//マクロ定義
//=====================================
#ifndef _TITLE_H_	//このマクロ定義がされてなかったら
#define _TITLE_H_	//2重インクルード防止のマクロ定義

//=====================================
//インクルード
//=====================================
#include "main.h"

//=====================================
//プロトタイプ宣言
//=====================================
void InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);

#endif
