//=========================================================
//DirectXでの8方向移動処理[tutorial.h]
//Author:Yumika Matsushita
//
//=========================================================

//=====================================
//マクロ定義
//=====================================
#ifndef _TUTORIAL_H_	//このマクロ定義がされてなかったら
#define _TUTORIAL_H_	//2重インクルード防止のマクロ定義

//=====================================
//インクルード
//=====================================
#include "main.h"

//=====================================
//プロトタイプ宣言
//=====================================
void InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);

#endif

